aaron-bond.better-comments
adpyke.codesnap
adpyke.vscode-sql-formatter
alefragnani.project-manager
anthropic.claude-code
anysphere.cursorpyright
artdiniz.strike-vscode
arvkevi.listipy
batisteo.vscode-django
bierner.color-info
bradlc.vscode-tailwindcss
catppuccin.catppuccin-vsc
catppuccin.catppuccin-vsc-icons
charliermarsh.ruff
christian-kohler.path-intellisense
dart-code.dart-code
dart-code.flutter
davidanson.vscode-markdownlint
dotjoshjohnson.xml
eamodio.gitlens
file-icons.file-icons
formulahendry.auto-rename-tag
foxundermoon.shell-format
github.vscode-pull-request-github
golang.go
grapecity.gc-excelviewer
hashicorp.terraform
helixquar.randomeverything
irongeek.vscode-env
jannchie.ruff-ignore-explainer
kisstkondoros.vscode-gutter-preview
mrmlnc.vscode-duplicate
ms-pyright.pyright
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.cpptools
njpwerner.autodocstring
oderwat.indent-rainbow
openai.chatgpt
pixl-garden.bongocat
prisma.prisma
redhat.vscode-xml
streetsidesoftware.code-spell-checker
svelte.svelte-vscode
tamasfe.even-better-toml
twxs.cmake
vscodevim.vim
wayou.vscode-todo-highlight
wholroyd.jinja
wix.vscode-import-cost
ysemeniuk.emmet-live
