tap "charmbracelet/tap"
tap "derailed/k9s"
tap "hashicorp/tap"
tap "jesseduffield/lazygit"
tap "nikitabobko/tap"
tap "oven-sh/bun"

# Portable ASCII art graphics library
brew "aalib"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Console Bonsai is a bonsai tree generator, written in C using ncurses
brew "cbonsai"
# A powerful terminal-based AI assistant for developers, providing intelligent coding assistance directly in your terminal.
brew "charmbracelet/tap/crush"
# Generate images of code and terminal output.
brew "charmbracelet/tap/freeze"
# A personal key value store 🛼
brew "charmbracelet/tap/skate"
# Console Matrix
brew "cmatrix"
# OpenAI's coding agent that runs in your terminal
brew "codex"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Securely send things from one computer to another
brew "croc"
# Power of curl, ease of use of httpie
brew "curlie"
# Lightweight, framework-agnostic database migration tool
brew "dbmate"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Render markdown on the CLI
brew "glow"
# Fast linters runner for Go
brew "golangci-lint"
# Command-line tool for generating regular expressions
brew "grex"
# ASCII-art displaying typo-corrector for commands
brew "gti"
# Tool for glamorous shell scripts
brew "gum"
# Terraform
brew "hashicorp/tap/terraform"
# Kubernetes package manager
brew "helm"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Command-line note taker
brew "jrnl"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Simple terminal UI for git commands
brew "lazygit"
# Postgres C API library
brew "libpq"
# YAML Parser
brew "libyaml"
# Rainbows and unicorns in your console!
brew "lolcat"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Mac App Store command-line interface
brew "mas"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Modern shell for the GitHub era
brew "nushell"
# Manage multiple Node.js versions
brew "nvm"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Password manager
brew "pass"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Modern API client that lives in your terminal
brew "posting"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Fast type checker and IDE for Python
brew "pyrefly"
# Static type checker for Python
brew "pyright"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Display and control your Android device
brew "scrcpy"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# SOund eXchange: universal sound sample translator
brew "sox"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Tool Command Language
brew "tcl-tk@8"
# User interface to the TELNET protocol
brew "telnet"
# Programmatically correct mistyped console commands
brew "thefuck"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Your CLI home video recorder
brew "vhs"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# General-purpose data compression with high compression ratio
brew "xz"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Zsh port of Fish shell's history search
brew "zsh-history-substring-search"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# ZSH plugin that reminds you to use existing aliases for commands you just typed
brew "zsh-you-should-use"

# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# AI Coding Agent IDE
cask "antigravity"
# Chromium based browser
cask "arc"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Compare files and folders
cask "beyond-compare"
# Desktop password and login vault
cask "bitwarden"
# Web browser focusing on privacy
cask "brave-browser"
# Screen recording software
cask "cap"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# OpenAI's official browser with ChatGPT built in
cask "chatgpt-atlas"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# Free app that makes your Internet safer
cask "cloudflare-warp"
# Write, edit, and chat about your code with AI
cask "cursor"
# Universal database tool and SQL client
cask "dbeaver-community"
# Utilities designed to make common development tasks easier
cask "devtoys"
# Voice and text chat software
cask "discord"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Graphically shows disk usage within a file system
cask "grandperspective"
# Utility to hide menu bar items
cask "hiddenbar"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Kubernetes IDE
cask "lens"
# Open-source cross-platform alternative to AirDrop
cask "localsend"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# Connect to your Android devices
cask "macdroid"
# Open-source, self-hosted Slack-alternative
cask "mattermost"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organised
cask "notion"
# Calculator and converter application
cask "numi"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Get up and running with large language models locally
cask "ollama-app"
# Replacement for Docker Desktop
cask "orbstack"
# Collaboration platform for API development
cask "postman"
# Proxy client
cask "proxifier"
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Spotify and iTunes in the menu bar
cask "spotmenu"
# System monitor for the menu bar
cask "stats"
# Open-source media center
cask "stremio"
# Text editor for code, markup and prose
cask "sublime-text"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin@21"
# Open-source BitTorrent client
cask "transmission"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Rust-based terminal
cask "warp"
# Native desktop client for WhatsApp
cask "whatsapp"
# Multiplayer code editor
cask "zed"

mas "Bitwarden", id: 1352778147
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Pages", id: 409201541
mas "Numbers", id: 409203825
mas "Blackmagic Disk Speed Test", id: 425264550
mas "Xcode", id: 497799835
mas "GarageBand", id: 682658836
mas "Amphetamine", id: 937984704
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "Blackmagic Disk Speed Test", id: 425264550
mas "GarageBand", id: 682658836
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
mas "iMovie", id: 408981434

vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "adpyke.vscode-sql-formatter"
vscode "alefragnani.project-manager"
vscode "anthropic.claude-code"
vscode "artdiniz.strike-vscode"
vscode "arvkevi.listipy"
vscode "batisteo.vscode-django"
vscode "bierner.color-info"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "file-icons.file-icons"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "hashicorp.terraform"
vscode "helixquar.randomeverything"
vscode "irongeek.vscode-env"
vscode "jannchie.ruff-ignore-explainer"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-azuretools.vscode-containers"
vscode "ms-pyright.pyright"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.cpptools"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "pixl-garden.bongocat"
vscode "prisma.prisma"
vscode "redhat.vscode-xml"
vscode "streetsidesoftware.code-spell-checker"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "twxs.cmake"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
vscode "wholroyd.jinja"
vscode "wix.vscode-import-cost"
vscode "ysemeniuk.emmet-live"

# cursor (brewsync extension)
cursor "aaron-bond.better-comments"
cursor "adpyke.codesnap"
cursor "adpyke.vscode-sql-formatter"
cursor "alefragnani.project-manager"
cursor "anthropic.claude-code"
cursor "anysphere.cursorpyright"
cursor "artdiniz.strike-vscode"
cursor "arvkevi.listipy"
cursor "batisteo.vscode-django"
cursor "bierner.color-info"
cursor "bradlc.vscode-tailwindcss"
cursor "catppuccin.catppuccin-vsc"
cursor "catppuccin.catppuccin-vsc-icons"
cursor "charliermarsh.ruff"
cursor "christian-kohler.path-intellisense"
cursor "dart-code.dart-code"
cursor "dart-code.flutter"
cursor "davidanson.vscode-markdownlint"
cursor "dotjoshjohnson.xml"
cursor "eamodio.gitlens"
cursor "file-icons.file-icons"
cursor "formulahendry.auto-rename-tag"
cursor "foxundermoon.shell-format"
cursor "github.vscode-pull-request-github"
cursor "golang.go"
cursor "grapecity.gc-excelviewer"
cursor "hashicorp.terraform"
cursor "helixquar.randomeverything"
cursor "irongeek.vscode-env"
cursor "jannchie.ruff-ignore-explainer"
cursor "kisstkondoros.vscode-gutter-preview"
cursor "mrmlnc.vscode-duplicate"
cursor "ms-pyright.pyright"
cursor "ms-python.debugpy"
cursor "ms-python.isort"
cursor "ms-python.python"
cursor "ms-python.vscode-python-envs"
cursor "ms-toolsai.jupyter"
cursor "ms-toolsai.jupyter-keymap"
cursor "ms-toolsai.jupyter-renderers"
cursor "ms-toolsai.vscode-jupyter-cell-tags"
cursor "ms-toolsai.vscode-jupyter-slideshow"
cursor "ms-vscode.cpptools"
cursor "njpwerner.autodocstring"
cursor "oderwat.indent-rainbow"
cursor "openai.chatgpt"
cursor "pixl-garden.bongocat"
cursor "prisma.prisma"
cursor "redhat.vscode-xml"
cursor "streetsidesoftware.code-spell-checker"
cursor "svelte.svelte-vscode"
cursor "tamasfe.even-better-toml"
cursor "twxs.cmake"
cursor "vscodevim.vim"
cursor "wayou.vscode-todo-highlight"
cursor "wholroyd.jinja"
cursor "wix.vscode-import-cost"
cursor "ysemeniuk.emmet-live"

# antigravity (brewsync extension)
antigravity "aaron-bond.better-comments"
antigravity "adpyke.codesnap"
antigravity "adpyke.vscode-sql-formatter"
antigravity "alefragnani.project-manager"
antigravity "anthropic.claude-code"
antigravity "artdiniz.strike-vscode"
antigravity "arvkevi.listipy"
antigravity "batisteo.vscode-django"
antigravity "bierner.color-info"
antigravity "bradlc.vscode-tailwindcss"
antigravity "catppuccin.catppuccin-vsc"
antigravity "catppuccin.catppuccin-vsc-icons"
antigravity "charliermarsh.ruff"
antigravity "christian-kohler.path-intellisense"
antigravity "dart-code.dart-code"
antigravity "dart-code.flutter"
antigravity "davidanson.vscode-markdownlint"
antigravity "devsense.composer-php-vscode"
antigravity "devsense.intelli-php-vscode"
antigravity "devsense.phptools-vscode"
antigravity "devsense.profiler-php-vscode"
antigravity "eamodio.gitlens"
antigravity "esbenp.prettier-vscode"
antigravity "formulahendry.auto-rename-tag"
antigravity "foxundermoon.shell-format"
antigravity "github.vscode-pull-request-github"
antigravity "golang.go"
antigravity "grapecity.gc-excelviewer"
antigravity "hashicorp.terraform"
antigravity "helixquar.randomeverything"
antigravity "irongeek.vscode-env"
antigravity "jannchie.ruff-ignore-explainer"
antigravity "kisstkondoros.vscode-gutter-preview"
antigravity "llvm-vs-code-extensions.vscode-clangd"
antigravity "meta.pyrefly"
antigravity "mrmlnc.vscode-duplicate"
antigravity "ms-azuretools.vscode-containers"
antigravity "ms-pyright.pyright"
antigravity "ms-python.debugpy"
antigravity "ms-python.python"
antigravity "ms-python.vscode-python-envs"
antigravity "ms-toolsai.jupyter"
antigravity "ms-toolsai.jupyter-keymap"
antigravity "ms-toolsai.jupyter-renderers"
antigravity "ms-toolsai.vscode-jupyter-cell-tags"
antigravity "ms-toolsai.vscode-jupyter-slideshow"
antigravity "ms-vscode.cpptools"
antigravity "njpwerner.autodocstring"
antigravity "oderwat.indent-rainbow"
antigravity "openai.chatgpt"
antigravity "pixl-garden.bongocat"
antigravity "prisma.prisma"
antigravity "redhat.java"
antigravity "redhat.vscode-xml"
antigravity "shopify.ruby-lsp"
antigravity "streetsidesoftware.code-spell-checker"
antigravity "svelte.svelte-vscode"
antigravity "tamasfe.even-better-toml"
antigravity "twxs.cmake"
antigravity "vscjava.vscode-gradle"
antigravity "vscjava.vscode-java-debug"
antigravity "vscjava.vscode-java-dependency"
antigravity "vscjava.vscode-java-pack"
antigravity "vscjava.vscode-java-test"
antigravity "vscjava.vscode-maven"
antigravity "vscodevim.vim"
antigravity "wayou.vscode-todo-highlight"
antigravity "wholroyd.jinja"
antigravity "wix.vscode-import-cost"
antigravity "ysemeniuk.emmet-live"

# go (brewsync extension)
go "github.com/air-verse/air"
go "github.com/andrew-sameh/brewsync/cmd/brewsync"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/maaslalani/nap"
go "github.com/pressly/goose/v3/cmd/goose"
go "github.com/sqlc-dev/sqlc/cmd/sqlc"
go "github.com/swaggo/swag/cmd/swag"
go "github.com/vektra/mockery/v2"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
