tap "charmbracelet/tap"
tap "homebrew/bundle"
tap "jesseduffield/lazygit"
tap "nikitabobko/tap"
brew "xz"
brew "openssl@3"
brew "bat"
brew "readline"
brew "sqlite"
brew "cmatrix"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "imagemagick"
brew "jq"
brew "libpq"
brew "lsd"
brew "neofetch"
brew "neovim"
brew "pipx"
brew "poppler"
brew "postgresql@16"
brew "pyenv"
brew "python@3.11"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "sevenzip"
brew "starship"
brew "stow"
brew "tcl-tk@8"
brew "telnet"
brew "thefuck"
brew "tmux"
brew "wget"
brew "yazi"
brew "zlib"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "zsh-you-should-use"
brew "charmbracelet/tap/skate"
brew "jesseduffield/lazygit/lazygit"
cask "aerospace"
cask "alt-tab"
cask "beyond-compare"
cask "bitwarden"
cask "devtoys"
cask "discord"
cask "font-symbols-only-nerd-font"
cask "hiddenbar"
cask "stats"
cask "sublime-text"
cask "whatsapp"
